import 'package:flutter/material.dart';

class Homework13Screen extends StatelessWidget {
  const Homework13Screen({super.key});

  @override
  Widget build(BuildContext context) {
    // TODO(student): Завдання:
    // 1. Створіть контейнер в body Scaffold віджету.
    // 2. Задайте йому розмір: ширина — 300, висота — 150.
    // 3. Розмістіть контейнер по центру екрану.
    // 4. Додайте фоновий колір контейнера: синій.
    // 5. Задайте заокруглення кутів — 16 пікселів.
    // 6. Усередині контейнера розмістіть текст: “Привіт, Flutter!”
    // 7. Текст повинен:
    //    - бути вирівняний по правому нижньому краю контейнера
    //    - мати білий колір
    //    - розмір шрифту — 20
    //    - жирний стиль (bold)
    // 8. Додайте в контейнер дві іконки у вигляді зірочки: зліва та справа від
    // тексту.
    // 9. Скопіюйте контейнер 2 рази, щоб у Column було 3 контейнери.
    // 10. Відстань між ними має буди 8 px по вертикалі
    // 11. Для кожного контейнера задайте різний колір: синій, зелений,
    // червоний.
    // 12. Змініть вирівнювання тексту (з зірочками) в контейнерах наступним
    // чином:
    //    - перший контейнер: по лівому верхньому краю
    //    - другий контейнер: по центру
    //    - третій контейнер: по правому нижньому краю
    // 13. Зробіть так, щоб перший контейнер займав все доступне вертикальне
    // місце.
    // За бажанням, додайте ще будь-які віджети які ми пройшли на занятті.
    // Якщо додасте їх, опишіть це в коментарі до домашнього завдання.

    return Scaffold(
      appBar: AppBar(
        title: const Text('Custom Container'),
      ),
      body: const SizedBox.shrink(),
    );
  }
}
