import 'package:flutter/material.dart';

class Homework13Screen extends StatelessWidget {
  const Homework13Screen({super.key});

  @override
  Widget build(BuildContext context) {
    // TODO(student): Завдання:
    // 1. Створіть контейнер в body Scaffold віджету.
    // 2. Задайте йому розмір: ширина — 300, висота — 150.
    // 3. Розмістіть контейнер по центру екрану.
    // 4. Додайте фоновий колір контейнера: синій.
    // 4. Задайте заокруглення кутів — 16 пікселів.
    // 7. Усередині контейнера розмістіть текст: "Привіт, Flutter!"
    // 8. Текст повинен:
    //    - бути вирівняний по правому нижньому краю контейнера
    //    - мати білий колір
    //    - розмір шрифту — 20
    //    - жирний стиль (bold)
    // 9. Додайте в контейнер дві іконки у вигляді зірочки. Зліва та зправа від
    // тексту.
    // 10. Додайте відступи між текстом та іконками: 10 пікселів.
    // 11. Помістіть свій контейнер у Column.
    // 12. Скопіюйте свій контейнер 2 рази, щоб у column було 3 контейнери.
    // 13. Для кожного контейнера задайте різний колір: синій, зелений, червоний
    // 14. Вирівнювання тескту має бути наступним:
    //    - перший контейнер: по лівому краю
    //    - другий контейнер: по центру
    //    - третій контейнер: по правому краю
    // 15. Зробіть так, щоб Ваш третій віджет займав все доступне місце.
    // 16. За бажанням, додайте ще будь-які віджети (але щоб вони не впливали
    // на поточні віджети)

    return Scaffold(
      appBar: AppBar(
        title: const Text('Custom Container'),
      ),
      body: const SizedBox.shrink(),
    );
  }
}
